# Cleaning The Customer Dataset

In [1]:
import pandas as pd
import numpy as np
import os

In [3]:
path = r'C:\Users\mosh_\OneDrive\Desktop\Career Foundry\Data Immersion\Achievement 4 - Python Fundemental For Data Analyst'

In [5]:
path

'C:\\Users\\mosh_\\OneDrive\\Desktop\\Career Foundry\\Data Immersion\\Achievement 4 - Python Fundemental For Data Analyst'

In [5]:
cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

### Checking the Data

In [7]:
cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [9]:
cust.shape

(206209, 10)

In [11]:
cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [13]:
list(cust.columns.values)

['user_id',
 'First Name',
 'Surnam',
 'Gender',
 'STATE',
 'Age',
 'date_joined',
 'n_dependants',
 'fam_status',
 'income']

In [ ]:
## Renaming some of the columns as well as changing to lower caser for consistency

In [15]:
cust.rename(columns = {'First Name' : 'first_name'}, inplace = True)
cust.rename(columns = {'Surnam' : 'surname'}, inplace = True)
cust.rename(columns = {'STATE' : 'state'}, inplace = True)
cust.rename(columns = {'Gender' : 'gender'}, inplace = True)
cust.rename(columns = {'Age' : 'age'}, inplace = True)
cust.rename(columns = {'n_dependants' : 'dependants'}, inplace = True)
cust.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [17]:
cust.head()

,user_id,first_name,surname,gender,state,age,date_joined,dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

#### Looking For Missing Values

In [19]:
cust.isnull().values.any()

True

In [21]:
cust.isnull().sum()

user_id               0
first_name        11259
surname               0
gender                0
state                 0
age                   0
date_joined           0
dependants            0
marital_status        0
income                0
dtype: int64

In [ ]:
## creating a seperate table with the missing values

In [23]:
cust[cust['first_name'].isnull()== True]

,user_id,first_name,surname,gender,state,age,date_joined,dependants,marital_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [ ]:
## As this as First names and not numbers i think it might be best to just leave them empty. 
## there is no way for me to impute the mean or mode values

#### Checking For Duplicate Values

In [25]:
cust[cust.duplicated()]

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, dependants, marital_status, income]
Index: []

In [ ]:
## There are no duplicated values in this dataset

#### Checking Data types

In [27]:
for col in cust.columns.tolist():
  weird = (cust[[col]].map(type) != cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (cust[weird]) > 0:
    print (col)

first_name

In [ ]:
## The first name column has mix data types
## I will be changing it to a string type

In [29]:
cust['first_name'] = cust['first_name'].astype('str')

In [ ]:
## double checking the datatype changed

In [31]:
for col in cust.columns.tolist():
  weird = (cust[[col]].map(type) != cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (cust[weird]) > 0:
    print (col)

#### Final check

In [33]:
cust.shape

(206209, 10)

In [35]:
list(cust.columns.values)

['user_id',
 'first_name',
 'surname',
 'gender',
 'state',
 'age',
 'date_joined',
 'dependants',
 'marital_status',
 'income']

In [37]:
cust.describe()

             user_id            age     dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

### Merging data sets

In [39]:
ords_prods_merge= pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merge_derived_grouped.pkl'))

In [45]:
list(ords_prods_merge.columns.values)

['order_id',
 'user_id',
 'eval_set',
 'order_number',
 'orders_day_of_the_week',
 'order_hour_of_day',
 'days_since_last_order',
 'product_id',
 'add_to_cart_order',
 'reordered',
 'product_name',
 'aisle_id',
 'department_id',
 'prices',
 'Match',
 'price_range_loc',
 'busiest_day',
 'busiest_period_of_day',
 'max_order',
 'loyalty_flag',
 'avg_price',
 'spending flag',
 'avg_days_between_order',
 'order frequency flag']

In [91]:
## having a look through the list of columns, I think will remove eval_set and Match, These are unneccasry
##  and once both datasets will be merged there will be too many columns.

In [47]:
ords_prods_merge = ords_prods_merge.drop(columns = ['eval_set','Match'])

In [48]:
ords_prods_merge.shape

(32404859, 22)

In [ ]:
## user_id is a columnn in both datasets to this will be my key column

In [ ]:
## checking if the key columns are the same data type

In [49]:
ords_prods_merge.dtypes

order_id                    int64
user_id                     int64
order_number                int64
orders_day_of_the_week      int64
order_hour_of_day           int64
days_since_last_order     float64
product_id                  int64
add_to_cart_order           int64
reordered                   int64
product_name               object
aisle_id                    int64
department_id               int64
prices                    float64
price_range_loc            object
busiest_day                object
busiest_period_of_day      object
max_order                   int64
loyalty_flag               object
avg_price                 float64
spending flag              object
avg_days_between_order    float64
order frequency flag       object
dtype: object

In [50]:
cust.dtypes

user_id            int64
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
dependants         int64
marital_status    object
income             int64
dtype: object

In [ ]:
## i will be merging both using user_id and will have an indicator

In [ ]:
## will change the datatypes from int64 to int32

In [55]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 22 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   order_number            int64
 3   orders_day_of_the_week  int64
 4   order_hour_of_day       int64
 5   days_since_last_order   float64
 6   product_id              int64
 7   add_to_cart_order       int64
 8   reordered               int64
 9   product_name            object
 10  aisle_id                int64
 11  department_id           int64
 12  prices                  float64
 13  price_range_loc         object
 14  busiest_day             object
 15  busiest_period_of_day   object
 16  max_order               int64
 17  loyalty_flag            object
 18  avg_price               float64
 19  spending flag           object
 20  avg_days_between_order  float64
 21  order frequency flag    object
dtypes: float64(4), int64(11), object(7)
memory usage: 5.3+ GB

In [57]:
ords_prods_merge['order_id'] =ords_prods_merge['order_id'].astype('int32')
ords_prods_merge['user_id'] =ords_prods_merge['user_id'].astype('int32')
ords_prods_merge['order_number'] =ords_prods_merge['order_number'].astype('int32')
ords_prods_merge['orders_day_of_the_week'] =ords_prods_merge['orders_day_of_the_week'].astype('int32')
ords_prods_merge['order_hour_of_day'] =ords_prods_merge['order_hour_of_day'].astype('int32')
ords_prods_merge['product_id'] =ords_prods_merge['product_id'].astype('int32')
ords_prods_merge['add_to_cart_order'] =ords_prods_merge['add_to_cart_order'].astype('int32')
ords_prods_merge['reordered'] =ords_prods_merge['reordered'].astype('int32')
ords_prods_merge['aisle_id'] =ords_prods_merge['aisle_id'].astype('int32')
ords_prods_merge['department_id'] =ords_prods_merge['department_id'].astype('int32')
ords_prods_merge['max_order'] =ords_prods_merge['max_order'].astype('int32')

In [59]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 22 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 int32
 2   order_number            int32
 3   orders_day_of_the_week  int32
 4   order_hour_of_day       int32
 5   days_since_last_order   float64
 6   product_id              int32
 7   add_to_cart_order       int32
 8   reordered               int32
 9   product_name            object
 10  aisle_id                int32
 11  department_id           int32
 12  prices                  float64
 13  price_range_loc         object
 14  busiest_day             object
 15  busiest_period_of_day   object
 16  max_order               int32
 17  loyalty_flag            object
 18  avg_price               float64
 19  spending flag           object
 20  avg_days_between_order  float64
 21  order frequency flag    object
dtypes: float64(4), int32(11), object(7)
memory usage: 4.0+ GB

In [61]:
cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  int64
 1   first_name      206209 non-null  object
 2   surname         206209 non-null  object
 3   gender          206209 non-null  object
 4   state           206209 non-null  object
 5   age             206209 non-null  int64
 6   date_joined     206209 non-null  object
 7   dependants      206209 non-null  int64
 8   marital_status  206209 non-null  object
 9   income          206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [63]:
cust['user_id'] =cust['user_id'].astype('int32')
cust['age'] =cust['age'].astype('int32')
cust['income'] =cust['income'].astype('int32')

In [65]:
cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  int32
 1   first_name      206209 non-null  object
 2   surname         206209 non-null  object
 3   gender          206209 non-null  object
 4   state           206209 non-null  object
 5   age             206209 non-null  int32
 6   date_joined     206209 non-null  object
 7   dependants      206209 non-null  int64
 8   marital_status  206209 non-null  object
 9   income          206209 non-null  int32
dtypes: int32(3), int64(1), object(6)
memory usage: 13.4+ MB

In [67]:
ords_prods_merge.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merge_final.pkl'))

In [69]:
cust.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'cust_final.pkl'))

In [3]:
path = r'C:\Users\mosh_\OneDrive\Desktop\Career Foundry\Data Immersion\Achievement 4 - Python Fundemental For Data Analyst'

In [5]:
path

'C:\\Users\\mosh_\\OneDrive\\Desktop\\Career Foundry\\Data Immersion\\Achievement 4 - Python Fundemental For Data Analyst'

In [11]:
cust = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'cust_final.pkl'))

In [7]:
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merge_final.pkl'))

In [13]:
cust.shape

(206209, 10)

In [15]:
ords_prods_merge.shape

(32404859, 22)

In [ ]:
## double checking the datatype are correct and int32

In [17]:
cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  int32
 1   first_name      206209 non-null  object
 2   surname         206209 non-null  object
 3   gender          206209 non-null  object
 4   state           206209 non-null  object
 5   age             206209 non-null  int32
 6   date_joined     206209 non-null  object
 7   dependants      206209 non-null  int64
 8   marital_status  206209 non-null  object
 9   income          206209 non-null  int32
dtypes: int32(3), int64(1), object(6)
memory usage: 13.4+ MB

In [19]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 22 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 int32
 2   order_number            int32
 3   orders_day_of_the_week  int32
 4   order_hour_of_day       int32
 5   days_since_last_order   float64
 6   product_id              int32
 7   add_to_cart_order       int32
 8   reordered               int32
 9   product_name            object
 10  aisle_id                int32
 11  department_id           int32
 12  prices                  float64
 13  price_range_loc         object
 14  busiest_day             object
 15  busiest_period_of_day   object
 16  max_order               int32
 17  loyalty_flag            object
 18  avg_price               float64
 19  spending flag           object
 20  avg_days_between_order  float64
 21  order frequency flag    object
dtypes: float64(4), int32(11), object(7)
memory usage: 4.0+ GB

In [21]:
final_merge = ords_prods_merge.merge(cust, on= ['user_id'], how = 'inner', indicator = True)

In [23]:
final_merge.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,product_name,...,first_name,surname,gender,state,age,date_joined,dependants,marital_status,income,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2539329,1,1,2,8,NaN,14084,2,0,Organic Unsweetened Vanilla Almond Milk,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,2539329,1,1,2,8,NaN,12427,3,0,Original Beef Jerky,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2539329,1,1,2,8,NaN,26088,4,0,Aged White Cheddar Popcorn,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,2539329,1,1,2,8,NaN,26405,5,0,XL Pick-A-Size Paper Towel Rolls,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [25]:
final_merge['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [15]:
cust.shape

(206209, 10)

In [17]:
ords_prods_merge.shape

(32404859, 22)

In [19]:
final_merge.shape

(32404859, 32)

In [27]:
final_merge = final_merge.drop(columns = ['_merge'])

In [29]:
final_merge.shape

(32404859, 31)

In [26]:
final_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 31 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 int32
 2   order_number            int32
 3   orders_day_of_the_week  int32
 4   order_hour_of_day       int32
 5   days_since_last_order   float64
 6   product_id              int32
 7   add_to_cart_order       int32
 8   reordered               int32
 9   product_name            object
 10  aisle_id                int32
 11  department_id           int32
 12  prices                  float64
 13  price_range_loc         object
 14  busiest_day             object
 15  busiest_period_of_day   object
 16  max_order               int32
 17  loyalty_flag            object
 18  avg_price               float64
 19  spending flag           object
 20  avg_days_between_order  float64
 21  order frequency flag    object
 22  first_name              object
 23  surname                 object
 24  gender                  object
 25  state                   object
 26  age                     int32
 27  date_joined             object
 28  dependants              int64
 29  marital_status          object
 30  income                  int32
dtypes: float64(4), int32(13), int64(1), object(13)
memory usage: 5.9+ GB

In [31]:
final_merge.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'final_merge.pkl'))